In [1]:
import numpy as np
import pandas as pd

## Object creation

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range('20130101',periods=6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))

In [7]:
df

                   A         B         C         D
2013-01-01  0.051848  0.554238  0.652611 -0.200810
2013-01-02 -0.229404 -0.601464 -1.350763  0.709920
2013-01-03  0.981070  0.214581 -1.040130 -1.299771
2013-01-04  0.487057  0.116113 -1.029858  1.021991
2013-01-05 -0.431403 -1.077893 -0.358153 -1.239049
2013-01-06  0.999367  1.102815  0.122308 -0.826128

Creating a DataFrame by passing a dict of objects that can be converted to series-like.

In [8]:
df2 = pd.DataFrame({
        'A': 1.,
        'B':pd.Timestamp('20150105'),
        'C':pd.Series(1,index=list(range(4)),dtype='complex'),
        'D':np.array([3]*4,dtype='int32'),    
        'E':pd.Categorical(['test','train','test','train'])
})
df2

     A          B                   C  D      E
0  1.0 2015-01-05  1.000000+0.000000j  3   test
1  1.0 2015-01-05  1.000000+0.000000j  3  train
2  1.0 2015-01-05  1.000000+0.000000j  3   test
3  1.0 2015-01-05  1.000000+0.000000j  3  train

The columns of the resulting DataFrame have different dtypes.

In [9]:
df2.dtypes

A           float64
B    datetime64[ns]
C        complex128
D             int32
E          category
dtype: object

In [10]:
df2.all()

A    True
B    True
C    True
D    True
E    True
dtype: bool

## Viewing data

In [11]:
df.head(2)

                   A         B         C        D
2013-01-01  0.051848  0.554238  0.652611 -0.20081
2013-01-02 -0.229404 -0.601464 -1.350763  0.70992

In [12]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.487057  0.116113 -1.029858  1.021991
2013-01-05 -0.431403 -1.077893 -0.358153 -1.239049
2013-01-06  0.999367  1.102815  0.122308 -0.826128

Display the index, columns:

In [13]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

DataFrame.to_numpy() gives a NumPy representation of the underlying data. Note that this can be an expensive operation when your DataFrame has columns with different data types, which comes down to a fundamental difference between pandas and NumPy: NumPy arrays have one dtype for the entire array, while pandas DataFrames have one dtype per column. When you call DataFrame.to_numpy(), pandas will find the NumPy dtype that can hold all of the dtypes in the DataFrame. This may end up being object, which requires casting every value to a Python object.

For df, our DataFrame of all floating-point values, DataFrame.to_numpy() is fast and doesnâ€™t require copying data.

In [15]:
df.to_numpy()

array([[ 0.05184789,  0.55423783,  0.65261103, -0.20081008],
       [-0.22940419, -0.60146385, -1.35076252,  0.70992002],
       [ 0.98107037,  0.21458105, -1.04013018, -1.29977131],
       [ 0.48705716,  0.11611308, -1.02985774,  1.0219911 ],
       [-0.43140297, -1.07789275, -0.35815316, -1.23904909],
       [ 0.99936743,  1.10281518,  0.12230822, -0.82612842]])

For df2, the DataFrame with multiple dtypes, DataFrame.to_numpy() is relatively expensive.

In [16]:
df2.to_numpy()

array([[1.0, Timestamp('2015-01-05 00:00:00'), (1+0j), 3, 'test'],
       [1.0, Timestamp('2015-01-05 00:00:00'), (1+0j), 3, 'train'],
       [1.0, Timestamp('2015-01-05 00:00:00'), (1+0j), 3, 'test'],
       [1.0, Timestamp('2015-01-05 00:00:00'), (1+0j), 3, 'train']],
      dtype=object)

describe() shows a quick statistic summary of your data:

In [17]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.309756  0.051398 -0.500664 -0.305641
std    0.610605  0.786215  0.778741  0.993520
min   -0.431403 -1.077893 -1.350763 -1.299771
25%   -0.159091 -0.422070 -1.037562 -1.135819
50%    0.269453  0.165347 -0.694005 -0.513469
75%    0.857567  0.469324  0.002193  0.482237
max    0.999367  1.102815  0.652611  1.021991

Transposing your data:

In [18]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.051848   -0.229404    0.981070    0.487057   -0.431403    0.999367
B    0.554238   -0.601464    0.214581    0.116113   -1.077893    1.102815
C    0.652611   -1.350763   -1.040130   -1.029858   -0.358153    0.122308
D   -0.200810    0.709920   -1.299771    1.021991   -1.239049   -0.826128

Sorting by an axis:

In [19]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2013-01-01 -0.200810  0.652611  0.554238  0.051848
2013-01-02  0.709920 -1.350763 -0.601464 -0.229404
2013-01-03 -1.299771 -1.040130  0.214581  0.981070
2013-01-04  1.021991 -1.029858  0.116113  0.487057
2013-01-05 -1.239049 -0.358153 -1.077893 -0.431403
2013-01-06 -0.826128  0.122308  1.102815  0.999367

Sorting by values:

In [20]:
df.sort_values(by='C')

                   A         B         C         D
2013-01-02 -0.229404 -0.601464 -1.350763  0.709920
2013-01-03  0.981070  0.214581 -1.040130 -1.299771
2013-01-04  0.487057  0.116113 -1.029858  1.021991
2013-01-05 -0.431403 -1.077893 -0.358153 -1.239049
2013-01-06  0.999367  1.102815  0.122308 -0.826128
2013-01-01  0.051848  0.554238  0.652611 -0.200810

## Selection

Note: While standard Python / Numpy expressions for selecting and setting are intuitive and come in handy for
interactive work, for production code, we recommend the optimized pandas data access methods, .at, .iat, .loc
and .iloc.

## Getting

Selecting a single column, which yields a Series, equivalent to df.A:

In [21]:
df['C']

2013-01-01    0.652611
2013-01-02   -1.350763
2013-01-03   -1.040130
2013-01-04   -1.029858
2013-01-05   -0.358153
2013-01-06    0.122308
Freq: D, Name: C, dtype: float64

Selecting via [], which slices the rows

In [22]:
df[1:3]

                   A         B         C         D
2013-01-02 -0.229404 -0.601464 -1.350763  0.709920
2013-01-03  0.981070  0.214581 -1.040130 -1.299771

In [23]:
df['20130102':'20130103']

                   A         B         C         D
2013-01-02 -0.229404 -0.601464 -1.350763  0.709920
2013-01-03  0.981070  0.214581 -1.040130 -1.299771

## Selection by label

In [24]:
df.loc[dates[0]]

A    0.051848
B    0.554238
C    0.652611
D   -0.200810
Name: 2013-01-01 00:00:00, dtype: float64

In [25]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.051848  0.554238
2013-01-02 -0.229404 -0.601464
2013-01-03  0.981070  0.214581
2013-01-04  0.487057  0.116113
2013-01-05 -0.431403 -1.077893
2013-01-06  0.999367  1.102815

Showing label slicing, both endpoints are included:

In [27]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.229404 -0.601464
2013-01-03  0.981070  0.214581
2013-01-04  0.487057  0.116113

Reduction in the dimensions of the returned object:

In [28]:
df.loc['20130102',['A','B']]

A   -0.229404
B   -0.601464
Name: 2013-01-02 00:00:00, dtype: float64

For getting a scalar value:

In [29]:
df.loc[dates[0],'A']

0.05184788709569353

For getting fast access to a scalar (equivalent to the prior method)

In [30]:
df.at[dates[0],'A']

0.05184788709569353

## Selection by position

In [31]:
df.iloc[3]

A    0.487057
B    0.116113
C   -1.029858
D    1.021991
Name: 2013-01-04 00:00:00, dtype: float64

By integer slices, acting similar to numpy/python:

In [33]:
df.iloc[2:5,0:2]

                   A         B
2013-01-03  0.981070  0.214581
2013-01-04  0.487057  0.116113
2013-01-05 -0.431403 -1.077893

By lists of integer position locations, similar to the numpy/python style:

In [36]:
df.iloc[[1,2,3,5],[0,2]]

                   A         C
2013-01-02 -0.229404 -1.350763
2013-01-03  0.981070 -1.040130
2013-01-04  0.487057 -1.029858
2013-01-06  0.999367  0.122308

For slicing rows explicitly:

In [38]:
df.iloc[0:3,:]

                   A         B         C         D
2013-01-01  0.051848  0.554238  0.652611 -0.200810
2013-01-02 -0.229404 -0.601464 -1.350763  0.709920
2013-01-03  0.981070  0.214581 -1.040130 -1.299771

For slicing columns explicitly

In [40]:
df.iloc[:,1:2]

                   B
2013-01-01  0.554238
2013-01-02 -0.601464
2013-01-03  0.214581
2013-01-04  0.116113
2013-01-05 -1.077893
2013-01-06  1.102815

For getting a value explicitly:

In [45]:
df.iloc[1,2]

-1.3507625166830457

For getting fast access to a scalar (equivalent to the prior method):

In [46]:
df.iat[1,1]

-0.6014638530918123

## Boolean indexing

In [48]:
df[df['A']<0]

                   A         B         C         D
2013-01-02 -0.229404 -0.601464 -1.350763  0.709920
2013-01-05 -0.431403 -1.077893 -0.358153 -1.239049

Selecting values from a DataFrame where a boolean condition is met.

In [50]:
df[df<0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN -0.200810
2013-01-02 -0.229404 -0.601464 -1.350763       NaN
2013-01-03       NaN       NaN -1.040130 -1.299771
2013-01-04       NaN       NaN -1.029858       NaN
2013-01-05 -0.431403 -1.077893 -0.358153 -1.239049
2013-01-06       NaN       NaN       NaN -0.826128

Using the isin() method for filtering:

In [51]:
df2 = df.copy()

In [52]:
df2['E'] = ['one','one','two','three','four','three']

In [53]:
df2

                   A         B         C         D      E
2013-01-01  0.051848  0.554238  0.652611 -0.200810    one
2013-01-02 -0.229404 -0.601464 -1.350763  0.709920    one
2013-01-03  0.981070  0.214581 -1.040130 -1.299771    two
2013-01-04  0.487057  0.116113 -1.029858  1.021991  three
2013-01-05 -0.431403 -1.077893 -0.358153 -1.239049   four
2013-01-06  0.999367  1.102815  0.122308 -0.826128  three

In [54]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.981070  0.214581 -1.040130 -1.299771   two
2013-01-05 -0.431403 -1.077893 -0.358153 -1.239049  four

## Setting

In [56]:
s1 = pd.Series([1,2,3,4,5,6],index=pd.date_range('20200101',periods=6))

In [61]:
s1

2020-01-01    1
2020-01-02    2
2020-01-03    3
2020-01-04    4
2020-01-05    5
2020-01-06    6
Freq: D, dtype: int64

In [62]:
df['F'] = s1

In [63]:
df

                   A         B         C         D   F
2013-01-01  0.051848  0.554238  0.652611 -0.200810 NaN
2013-01-02 -0.229404 -0.601464 -1.350763  0.709920 NaN
2013-01-03  0.981070  0.214581 -1.040130 -1.299771 NaN
2013-01-04  0.487057  0.116113 -1.029858  1.021991 NaN
2013-01-05 -0.431403 -1.077893 -0.358153 -1.239049 NaN
2013-01-06  0.999367  1.102815  0.122308 -0.826128 NaN

Setting values by label:

In [64]:
df.at[dates[0],'A'] = 0

Setting values by position:

In [65]:
df.iat[0,1] = 0

Setting by assigning with a NumPy array:

In [66]:
df.loc[:,'D'] = np.array([5]*len(df))

Setting by assigning with a NumPy array:

In [67]:
df

                   A         B         C  D   F
2013-01-01  0.000000  0.000000  0.652611  5 NaN
2013-01-02 -0.229404 -0.601464 -1.350763  5 NaN
2013-01-03  0.981070  0.214581 -1.040130  5 NaN
2013-01-04  0.487057  0.116113 -1.029858  5 NaN
2013-01-05 -0.431403 -1.077893 -0.358153  5 NaN
2013-01-06  0.999367  1.102815  0.122308  5 NaN

A where operation with setting

In [68]:
df2 = df.copy()

In [69]:
df2[df2>0] = -df2

In [70]:
df2

                   A         B         C  D   F
2013-01-01  0.000000  0.000000 -0.652611 -5 NaN
2013-01-02 -0.229404 -0.601464 -1.350763 -5 NaN
2013-01-03 -0.981070 -0.214581 -1.040130 -5 NaN
2013-01-04 -0.487057 -0.116113 -1.029858 -5 NaN
2013-01-05 -0.431403 -1.077893 -0.358153 -5 NaN
2013-01-06 -0.999367 -1.102815 -0.122308 -5 NaN

## Missing dat

In [71]:
df1 = df.reindex(index=dates[0:4],columns=list(df.columns)+['E'])

In [72]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [73]:
df1

                   A         B         C  D   F    E
2013-01-01  0.000000  0.000000  0.652611  5 NaN  1.0
2013-01-02 -0.229404 -0.601464 -1.350763  5 NaN  1.0
2013-01-03  0.981070  0.214581 -1.040130  5 NaN  NaN
2013-01-04  0.487057  0.116113 -1.029858  5 NaN  NaN

To drop any rows that have missing data

In [74]:
df1.dropna(how='any')

Empty DataFrame
Columns: [A, B, C, D, F, E]
Index: []

Filling missing data

In [76]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.652611  5  5.0  1.0
2013-01-02 -0.229404 -0.601464 -1.350763  5  5.0  1.0
2013-01-03  0.981070  0.214581 -1.040130  5  5.0  5.0
2013-01-04  0.487057  0.116113 -1.029858  5  5.0  5.0

To get the boolean mask where values are nan

In [77]:
pd.isna(df1)

                A      B      C      D     F      E
2013-01-01  False  False  False  False  True  False
2013-01-02  False  False  False  False  True  False
2013-01-03  False  False  False  False  True   True
2013-01-04  False  False  False  False  True   True

In [79]:
df[pd.isna(df1)]

             A   B   C   D   F
2013-01-01 NaN NaN NaN NaN NaN
2013-01-02 NaN NaN NaN NaN NaN
2013-01-03 NaN NaN NaN NaN NaN
2013-01-04 NaN NaN NaN NaN NaN
2013-01-05 NaN NaN NaN NaN NaN
2013-01-06 NaN NaN NaN NaN NaN